DataProcessors/ТелеграмИИТрансляцияКамеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<DataProcessor>
		<Properties>
			<Name>ТелеграмИИТрансляцияКамеры</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ТелеграмОбработкаСообщенийИИАктивные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<InformationRegister>
		<Properties>
			<Name>ТелеграмОбработкаСообщенийИИАктивные</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РасположениеПроцедуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеОбработки</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НазваниеПроцедуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущиеДанные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТелеграмКонтакт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелеграмКонтакты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТелеграмСообщенияИсходящиеОтправленные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<InformationRegister>
		<Properties>
			<Name>ТелеграмСообщенияИсходящиеОтправленные</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СообщениеИД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ТелеграмСообщенияИсходящие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТекущиеДанныеОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<InformationRegister>
		<Properties>
			<Name>ТекущиеДанныеОборудования</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>32</v8:Digits>
							<v8:FractionDigits>10</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Хранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Оборудование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектДанных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
						<v8:TypeSet>cfg:BusinessProcessRoutePointRef</v8:TypeSet>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>32</v8:Digits>
							<v8:FractionDigits>10</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ТелеграмИИТрансляцияКамеры/Ext/ManagerModule.bsl
Процедура ФоновыйПроцессТрансляцииКамеры(ТелеграмКонтакт) Экспорт //ОбновляетФотографию
	
	NativeS = К.NativeПодключитьКомпоненту();	  // Для управления задержкой
	Если NativeS = Неопределено Тогда 
		ЗаписьВЖурналОшибок("Обработки.ТелеграмИИТрансляцияКамеры", "ФоновыйПроцессТрансляцииКамеры", "Не удалось подключить компоненту Native.");
		Возврат;
	КонецЕсли;

	
	Пока Истина Цикл
		МенеджерЗаписи = РегистрыСведений.ТелеграмОбработкаСообщенийИИАктивные.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ТелеграмКонтакт = ТелеграмКонтакт;
		МенеджерЗаписи.Прочитать();
		Если МенеджерЗаписи.РасположениеПроцедуры = "Обработки.ТелеграмИИТрансляцияКамеры" И МенеджерЗаписи.НазваниеПроцедуры = "ПроцедураДляВызова"  Тогда
			ТекущиеДанные = МенеджерЗаписи.ТекущиеДанные.Получить();
			Если ТекущиеДанные.Транслировать = Истина Тогда	
				// Повторяем отправку новой картинке после того как убедимся в окончании отправки старой
				
				ИДГлавногоСообщения = РегистрыСведений.ТелеграмСообщенияИсходящиеОтправленные.Получить(Новый Структура("Сообщение", ТекущиеДанные.ИсхСообщениеТрансляции)).СообщениеИД;
					 
				Если ЗначениеЗаполнено(ИДГлавногоСообщения) Тогда
					Если ТекущиеДанные.Свойство("СсылкаНаДокСообщениеИсхКорректировочное") Тогда
						ПоследнееОтправленноеСообщение = ТекущиеДанные.СсылкаНаДокСообщениеИсхКорректировочное;
					Иначе
						ПоследнееОтправленноеСообщение = ТекущиеДанные.ИсхСообщениеТрансляции;
					КонецЕсли;
					
					Если ЗначениеЗаполнено(РегистрыСведений.ТелеграмСообщенияИсходящиеОтправленные.Получить(Новый Структура("Сообщение", ПоследнееОтправленноеСообщение)).СообщениеИД) Тогда
					//ПоследнееСообщение было отправлено, можно отправлять следующее
					
						ОбщегоНазначения.ЗаписатьДанныеОборудования(ТекущиеДанные.Камера, "Транслировать", 1, ТекущаяДата());

						ЗаписьРегистра = РегистрыСведений.ТекущиеДанныеОборудования.Получить(Новый Структура("Оборудование, ОбъектДанных", ТекущиеДанные.Камера, "Трансляция"));
						Если ТекущиеДанные.ДатаПоследнегоОтправленногоСнимка <> ЗаписьРегистра.Дата Тогда // Удостоверимся что фотография обновлена, отправка чаще раза в сек всё равно невозможна 
							ДвоичныйДанныеФотографии = ЗаписьРегистра.Хранилище.Получить();
							ФотоСКамеры = Новый Картинка(ДвоичныйДанныеФотографии);
							ПолныйПутьКФайлуСФото = ПолучитьИмяВременногоФайла("jpg");
							ФотоСКамеры.Записать(ПолныйПутьКФайлуСФото);
							Если ФотоСКамеры.РазмерФайла() >= 100 Тогда // Если изображение меньше 100 байт тогда считаем что файл пустой								
								Сообщение = Новый Структура();
								Сообщение.Вставить("ТелеграмКонтакт", ТелеграмКонтакт);
								Сообщение.Вставить("ФайлПуть", ПолныйПутьКФайлуСФото);
								Сообщение.Вставить("ФайлТип", "photo");				
								Сообщение.Вставить("ИДРедактируемогоСообщения", ИДГлавногоСообщения);
								СсылкаНаДокСообщениеИсхКорректировочное = ТелеграмМодуль.СоздатьИОтправитьДокСообщениеИсходящие(Сообщение);
								
								ТекущиеДанные.ДатаПоследнегоОтправленногоСнимка = ЗаписьРегистра.Дата; 
								ТекущиеДанные.Вставить("СсылкаНаДокСообщениеИсхКорректировочное", СсылкаНаДокСообщениеИсхКорректировочное);
								
								МенеджерЗаписи.ТекущиеДанные = Новый ХранилищеЗначения(ТекущиеДанные);
								МенеджерЗаписи.ДатаЗаписи = ТекущаяДата();
								МенеджерЗаписи.Записать(Истина);
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;		
				КонецЕсли;
			Иначе
				Прервать; // Трансляция выключена	
			КонецЕсли;
		Иначе
			Прервать; // ИИ был выключен
		КонецЕсли;
		NativeS.Задержка(500);
	КонецЦикла;	
	
	
		
			
	
КонецПроцедуры
